Revit 2024 API
SolidGlass.SolidglassColorByObject Property
 The property labeled "Custom Color" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string SolidglassColorByObject { get; }
Visual Basic
Public Shared ReadOnly Property SolidglassColorByObject As String
	Get
Visual C++
public:
static property String^ SolidglassColorByObject {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace